artillery-test.yml
config:
  target: "https://store-space.onrender.com/"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Warm up"
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: "Ramping"
    - duration: 60
      arrivalRate: 100
      rampTo: 200
      name: "Peak"


  plugins:
    ensure: {}
    apdex: {} 
    metrics-by-endpoint: {} 
  apdex:
  thresholds:
    satisfied: 200
    tolerating: 500
  ensure:
    threshold:
      -- http.response_time.p99: 100
      -- htpp.response_time.p95: 75


scenarios:
  - name: "Test Listing API"
    flow:
      - loop:
        - get:
            url: "/api/listings"
        count: 100

  - name: "Test Login API"
    flow:
      - loop:
        - post:
            url: "api/auth/login"
            json:
                email: "test@test.com"
                password: "123456"
        count: 100